src/Documents/СписаниеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Comment>Статья расходов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СписаниеЗапасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	// Установим реквизиты
	ВидОперации = Объект.ВидОперации;
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы); 
	СоздатьМенюУправленияТабличнымиЧастями();
	ОбновитьЗаголовкиТабЧастейНаСервере();
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СписаниеЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли; 
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОкрытии
//
Процедура ПриОткрытии(Отказ)
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, обработчик события "ПослеЗаписи"
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Склад".
//
Процедура СкладПриИзменении(Элемент)  	
	
	УстановитьДоступностьЭлементов();

	Если Объект.Запасы.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("СкладПриИзмененииЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, "Хотите изменить значение ""Склад"" в строках табличной части?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Склад при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СкладПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
			СтрокаТЧ.Склад = Объект.Склад;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
&НаКлиенте
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);  	
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Номенклатура"
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаДанных = Элементы.Запасы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.Упаковка) Тогда	
		СтрокаДанных.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "УпаковкаПоумолчанию");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.КоличествоУпаковок) Тогда
		СтрокаДанных.КоличествоУпаковок = 1;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаДанных);
	
	СтрокаДанных.Склад                      = Объект.Склад;
	
	СтрокаДанных.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ИспользоватьПартии");
	СтрокаДанных.ЭтоСертификат              = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ТипНоменклатуры")=ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
	ОбновитьЗаголовкиТабЧастейНаСервере();
		
КонецПроцедуры

// Процедура, обработчик  события "ПриИзменении" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры

// Процедура, обработчик события нажатие кнопки "ПерезаполнитьПоИнвентаризации"
//
&НаКлиенте
Процедура ПерезаполнитьПоИнвентаризации(Команда)
	
	Если Объект.ДокументОснование.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Этот документ не имеет основания!'");
		Сообщение.Сообщить();
	Иначе
		
		ОписаниОповещения = Новый ОписаниеОповещения("ПерезаполнитьПоИнвентаризацииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниОповещения, "Вы уверены, что хотите перезаполнить документ по основанию?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перезаполнить по инвентаризации завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПерезаполнитьПоИнвентаризацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Запасы.Очистить();
		ЗаполнитьПоИнвентаризацииНаСервере();
	КонецЕсли;

КонецПроцедуры

// Процедура, выполняет заполнение таблицы "Запасы" данными по инвентаризации.
//  Параметры:
//   Нет;
//
&НаСервере
Процедура ЗаполнитьПоИнвентаризацииНаСервере()

	ВремОбъект = РеквизитФормыВЗначение("Объект");

	ВремОбъект.ОбработкаЗаполнения(Объект.ДокументОснование, );

	ЗначениеВРеквизитФормы(ВремОбъект, "Объект");
		   
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
// Обработчи кнопки заполнения специлазиции из номенклатуры
//
Процедура ЗаполнитьСпециализациюИзНоменклатуры(Команда)
	ЗаполнитьСпециализациюИзНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
// Выполнить заполнение специализации из номенклатуры
//
Процедура ЗаполнитьСпециализациюИзНоменклатурыНаСервере()
	Для Каждого СтрокаТ ИЗ Объект.Запасы Цикл
		СтрокаТ.Специализация = СтрокаТ.Номенклатура.Специализация; 
	КонецЦикла;
КонецПроцедуры

// ==================================================МеханизмВнешнегоОборудования======================================================

&НаКлиенте
// ПодключаемоеОборудование
//
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , Объект.Ссылка, Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыНоменклатураПриИзменении(Элементы.Запасы.ТекущиеДанные);
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;						
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
Процедура ПоискПоШтрихкоду(Команда)

	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект), "", НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Поиск по штрихкоду завершение
//
// Параметры:
//  Значение				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПоискПоШтрихкодуЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Значение = Неопределено, "", Значение);
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихкод = Новый Массив;
		МассивШтрихкод.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихкод);
	КонецЕсли;

КонецПроцедуры

// ================================================Конец МеханизмВнешнегоОборудования==================================================
  
&НаКлиенте
// Процедура - обработчик события на сервере "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации <> ВидОперации Тогда
		Объект.Склад = Неопределено;
		УстановитьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события на сервере "НачалоВыбора" поля "ВидОперации".
//
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВидОперации = Объект.ВидОперации;
КонецПроцедуры

&НаКлиенте
// Процедура оработчик команды "Подбор"
//
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти  = "Запасы";
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Склад",	   			   Объект.Склад);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	// ПараметрыПодбора.Вставить("ВидЦен",	   			   Объект.ВидЦен);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора подбора
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		ОбновитьЗаголовкиТабЧастейНаСервере();
		Модифицированность = Истина;
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
// При изменении статьи затрат  
//
Процедура СтатьяРасходовПриИзменении(Элемент)	

	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовПриИзмененииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Перезаполнять заполненные значения в табличной части?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статья расходов при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтатьяРасходовПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьЗаполненные = РезультатВопроса = КодВозвратаДиалога.Да;
	Для Каждого СтрокаТ ИЗ Объект.Запасы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяРасходов) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
			СтрокаТ.СтатьяРасходов = Объект.СтатьяРасходов;
		КонецЕсли;;
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок,  Упаковка";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		// ЭтоНовый = Ложь;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = Строки[0];
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
			// СтрокаТабличнойЧасти.КлючСтроки     =  Новый УникальныйИдентификатор;
			// ЭтоНовый = Истина;
		КонецЕсли;
		
	    СтрокаТабличнойЧасти.Номенклатура       = СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.Партия             = СтрокаЗагрузки.Партия;
		СтрокаТабличнойЧасти.КоличествоУпаковок = СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество         = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Упаковка           = СтрокаЗагрузки.Упаковка;
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Склад) Тогда  
			СтрокаТабличнойЧасти.Склад          = Объект.Склад;
		КонецЕсли;
		СтрокаТабличнойЧасти.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаЗагрузки.Номенклатура, "ТипНоменклатуры")=ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));	
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяРасходов) Тогда
			СтрокаТабличнойЧасти.СтатьяРасходов = ?(ЗначениеЗаполнено(Объект.СтатьяРасходов),Объект.СтатьяРасходов,ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.НедостачиЗапасов")); 
		КонецЕсли;
		// СтрокаТабличнойЧасти.СтавкаНДС          = СтрокаЗагрузки.СтавкаНДС;
		
		// СтрокаТабличнойЧасти.Сумма 		        = СтрокаЗагрузки.Сумма;
		// СтрокаТабличнойЧасти.СуммаНДС 	        = СтрокаЗагрузки.СуммаНДС;
		// СтрокаТабличнойЧасти.Всего 		        = СтрокаЗагрузки.Всего;
		
	КонецЦикла;
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиенте
// Процедура - обработчик события на сервере "ПриИзменении" поля "ДокументОснование".
//
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьШапкуДокументаПоОснованию();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
// Процедура - заполняет шапку документа по основанию
//
Процедура ЗаполнитьШапкуДокументаПоОснованию()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
		ЭтоИнвентаризация = (ТипЗнч(Объект)=Тип("ДокументСсылка.ИнвентаризацияЗапасов"));
		Объект.ВидОперации = ?(ЭтоИнвентаризация, Объект.ВидОперации, Перечисления.ВидыОпераций.ПоСкладу);
		ЗаполнитьЗначенияСвойств(Объект, Объект.ДокументОснование, "Склад, СтруктурнаяЕдиница"+?(ЭтоИнвентаризация,",ВидОперации",""));
		Объект.Запасы.Очистить();
	КонецЕсли;

КонецПроцедуры // ЗаполнитьШапкуДокументаПоОснованию()

&НаКлиенте
Процедура УстановитьДоступностьЭлементов(ТипСтр = "СправочникСсылка.")
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСкладу") Тогда
		ТипСтр = ТипСтр + "Склады";
		Элементы.Склад.Заголовок = "Склад";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСотруднику") Тогда
		ТипСтр = ТипСтр + "Сотрудники";
		Элементы.Склад.Заголовок = "Персонал";
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.ЗапасыСклад.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	
КонецПроцедуры

&НаКлиенте   
// При начале редактирования таблицы 
//
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока = Истина Тогда
		Элементы.Запасы.ТекущиеДанные.СтатьяРасходов = ?(ЗначениеЗаполнено(Объект.СтатьяРасходов),Объект.СтатьяРасходов,ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.НедостачиЗапасов"));		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , Объект.Склад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
        мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОписаниеОповещения =  Новый ОписаниеОповещения("ЗапасыПартияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти));
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Запасы партия начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗапасыПартияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;
	
	Если НЕ Результат = Неопределено Тогда
		СтрокаТабличнойЧасти.Партия = Результат[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Запасы"        , "ГруппаЗапасы");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыПриИзменении(Элемент)
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

#Область ЗагрузкаДанныхИзВнешнегоИсточника

&НаКлиенте
// Процедура обработчик команды "Импорт".
// 
Процедура Импорт(Команда)
	
	// ОткрытьФорму("Обработка.ИмпортТабличныхЧастей.Форма", Новый Структура("МассивРазрешенныхТипов", Элементы.ЗапасыНоменклатура.ПараметрыВыбора[0].Значение),,,,, Новый ОписаниеОповещения("ИмпортЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "СписаниеЗапасов.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяОбъектаЗаполнения", "Документ.СписаниеЗапасов.ТабличнаяЧасть.Запасы");	
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеДатыВЗаказе", Объект.ПоложениеДатыОтгрузки);
	//  НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеСклада", Объект.ПоложениеСклада);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

&НаСервере
// Процедура, загрузка из фала на сервере (альтернатива).
// 
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока  = Объект.Запасы.Добавить();
		ИменаСвойств = "Номенклатура, Количество";
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
		
		НоваяСтрока.КоличествоУпаковок  = СтрокаТаблицы.Количество;
		НоваяСтрока.Упаковка		    = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
		НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
		НоваяСтрока.Партия			    = СтрокаТаблицы.Партия;
		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда	
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, загрузка из файла завершение (альтернатива).
//
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных)
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка результата.
//
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе	
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработка события "СотрудникРасходаПриИзменении".
//
Процедура СотрудникРасходаПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СотрудникРасходаПриИзмененииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Перезаполнять заполненные значения в табличной части?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сотрудник расхода при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СотрудникРасходаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьЗаполненные = РезультатВопроса = КодВозвратаДиалога.Да;
	
	Для Каждого СтрокаТ ИЗ Объект.Запасы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СотрудникРасхода) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
			СтрокаТ.СотрудникРасхода = Объект.СотрудникРасхода;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Процедура, добавляет данные в табличную часть.
//
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура, Количество";
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
				
				НоваяСтрока.КоличествоУпаковок  = СтрокаТаблицы.Количество;
				НоваяСтрока.Упаковка		    = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
				НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
				НоваяСтрока.Партия			    = СтрокаТаблицы.Партия;
				НоваяСтрока.Склад 			    = Объект.Склад;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяРасходов) Тогда
					НоваяСтрока.СтатьяРасходов = ?(ЗначениеЗаполнено(Объект.СтатьяРасходов), Объект.СтатьяРасходов, Справочники.СтатьиДоходовИРасходов.НедостачиЗапасов);	
				КонецЕсли;

				ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ОбновитьЗаголовкиТабЧастейНаСервере();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.СписаниеЗапасов, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
// Процедура При чтении на сервере.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

#КонецОбласти

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "СписаниеЗапасов");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.СписаниеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции
